Revit 2027 API
PointCloudEngineRegistry.RegisterPointCloudEngine Method
 Registers a new point cloud engine and associates it to a particular file extension.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RegisterPointCloudEngine(
	string identifier,
	IPointCloudEngine engine,
	bool isFileBased
)
Public Shared Sub RegisterPointCloudEngine (
	identifier As String,
	engine As IPointCloudEngine,
	isFileBased As Boolean
)
public:
static void RegisterPointCloudEngine(
	String^ identifier,
	IPointCloudEngine^ engine,
	bool isFileBased
)
static member RegisterPointCloudEngine :
        identifier : string *
        engine : IPointCloudEngine *
        isFileBased : bool -> unit
Parameters
identifier String
 A string that distinguishes the engine being registered. If isFileBased is true, this should be the file extension (e.g. "rcs" or "rcp"). If isFileBased is false, this identifier is used only by API calls and should be unique.
engine IPointCloudEngine
 The point cloud engine that governs point clouds matching the input identifier.
isFileBased Boolean
 Indicates to Revit if a single Point Cloud corresponds to a single file on disk.
Exceptions
Exception | Condition
ArgumentException |  The same identifier has already been registered by another engine.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace